In [1]:
people = {
    "first": ["Bayardo", "Josue"],
    "last": ["Lopez", "Salazar"],
    "email": ["bjlslopez@gmail.com", "bjlopezs@hotmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [8]:
df

  first_name last_name                 email
0    Bayardo     Lopez   bjlslopez@gmail.com
1      Josue   Salazar  bjlopezs@hotmail.com

In [9]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                 email
0    Bayardo     Lopez   bjlslopez@gmail.com
1      Josue   Salazar  bjlopezs@hotmail.com

In [10]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                 email
0    Bayardo     Lopez   bjlslopez@gmail.com
1      Josue   Salazar  bjlopezs@hotmail.com

In [11]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [12]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [13]:
df.loc[1] = ['Joshua', 'Salazar', 'bjlopezs@hotmail.com']

In [14]:
df.loc[1, ['first', 'email']] = ['Josue', 'bjlopezs@hotmail.com']

In [15]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [16]:
filt = (df['email'] == 'bjlopezs@gmail.com')
df.loc[filt, 'last'] = 'Lopez'

In [17]:
df['email'] = df['email'].str.lower()

In [18]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [19]:
df['email'].apply(len)

0    19
1    20
Name: email, dtype: int64

In [20]:
def update_email(email):
    return email.upper()

In [21]:
df['email'] = df['email'].apply(update_email)

In [22]:
df

     first     last                 email
0  Bayardo    Lopez   BJLSLOPEZ@GMAIL.COM
1    Josue  Salazar  BJLOPEZS@HOTMAIL.COM

In [23]:
df['email'] = df['email'].apply(lambda email: email.lower())

In [24]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [25]:
df['email'].apply(len)

0    19
1    20
Name: email, dtype: int64

In [26]:
df.apply(len)

first    2
last     2
email    2
dtype: int64

In [27]:
len(df['email'])

2

In [28]:
df.apply(len, axis='columns')

0    3
1    3
dtype: int64

In [29]:
df.apply(pd.Series.min)

first                 Bayardo
last                    Lopez
email    bjlopezs@hotmail.com
dtype: object

In [30]:
df.apply(lambda series: series.min())

first                 Bayardo
last                    Lopez
email    bjlopezs@hotmail.com
dtype: object

In [31]:
df.applymap(len)

   first  last  email
0      7     5     19
1      5     7     20

In [32]:
df.applymap(str.lower)

     first     last                 email
0  bayardo    lopez   bjlslopez@gmail.com
1    josue  salazar  bjlopezs@hotmail.com

In [33]:
df['first'].map({'Bayardo': 'Josue', 'Josue': 'Bayardo'})

0      Josue
1    Bayardo
Name: first, dtype: object

In [34]:
df['first'].replace({'Josue': 'Bayardo', 'Bayardo': 'Josue'})

0      Josue
1    Bayardo
Name: first, dtype: object

In [35]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com